# set up Zsh completions with plugins
# mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

# Git plugin from Oh My Zsh
ohmyzsh/ohmyzsh path:plugins/git

# prompts:
#   with prompt plugins, remember to add this to your .zshrc:
#   `autoload -Uz promptinit && promptinit && prompt pure`
# sindresorhus/pure     kind:fpath
romkatv/powerlevel10k kind:fpath

# popular fish-like plugins
# mattmc3/zfunctions
zsh-users/zsh-autosuggestions
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-history-substring-search
zsh-users/zsh-syntax-highlighting
# marlonrichert/zsh-autocomplete

junegunn/fzf path:shell kind:defer
supercrabtree/k
